wrk/results/get_lock.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 1.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.280ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms    0.86ms  17.38ms   94.19%
    Req/Sec   842.18    226.65     1.89k    62.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.12ms
 75.000%    1.40ms
 90.000%    1.72ms
 99.000%    5.04ms
 99.900%   10.28ms
 99.990%   16.31ms
 99.999%   17.39ms
100.000%   17.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.283     0.000000            1         1.00
       0.637     0.100000         3152         1.11
       0.779     0.200000         6282         1.25
       0.898     0.300000         9422         1.43
       1.013     0.400000        12580         1.67
       1.125     0.500000        15705         2.00
       1.179     0.550000        17269         2.22
       1.232     0.600000        18855         2.50
       1.287     0.650000        20422         2.86
       1.344     0.700000        21984         3.33
       1.404     0.750000        23557         4.00
       1.438     0.775000        24347         4.44
       1.472     0.800000        25121         5.00
       1.514     0.825000        25899         5.71
       1.568     0.850000        26685         6.67
       1.631     0.875000        27467         8.00
       1.671     0.887500        27870         8.89
       1.723     0.900000        28257        10.00
       1.793     0.912500        28649        11.43
       1.872     0.925000        29036        13.33
       1.989     0.937500        29431        16.00
       2.055     0.943750        29625        17.78
       2.157     0.950000        29825        20.00
       2.309     0.956250        30019        22.86
       2.483     0.962500        30214        26.67
       2.721     0.968750        30411        32.00
       2.897     0.971875        30510        35.56
       3.105     0.975000        30606        40.00
       3.419     0.978125        30704        45.71
       3.741     0.981250        30802        53.33
       4.175     0.984375        30900        64.00
       4.395     0.985938        30950        71.11
       4.623     0.987500        31000        80.00
       4.827     0.989062        31047        91.43
       5.147     0.990625        31096       106.67
       5.503     0.992188        31145       128.00
       5.747     0.992969        31170       142.22
       5.911     0.993750        31194       160.00
       6.267     0.994531        31219       182.86
       6.663     0.995313        31243       213.33
       7.087     0.996094        31268       256.00
       7.271     0.996484        31280       284.44
       7.579     0.996875        31292       320.00
       7.915     0.997266        31305       365.71
       8.319     0.997656        31317       426.67
       8.735     0.998047        31329       512.00
       9.191     0.998242        31335       568.89
       9.359     0.998437        31341       640.00
       9.719     0.998633        31348       731.43
       9.951     0.998828        31354       853.33
      10.423     0.999023        31360      1024.00
      11.151     0.999121        31363      1137.78
      11.855     0.999219        31366      1280.00
      12.407     0.999316        31369      1462.86
      12.567     0.999414        31372      1706.67
      13.079     0.999512        31375      2048.00
      13.607     0.999561        31377      2275.56
      13.967     0.999609        31378      2560.00
      14.151     0.999658        31380      2925.71
      14.495     0.999707        31381      3413.33
      14.679     0.999756        31383      4096.00
      15.191     0.999780        31384      4551.11
      15.191     0.999805        31384      5120.00
      15.295     0.999829        31385      5851.43
      16.111     0.999854        31386      6826.67
      16.311     0.999878        31387      8192.00
      16.311     0.999890        31387      9102.22
      16.311     0.999902        31387     10240.00
      16.671     0.999915        31388     11702.86
      16.671     0.999927        31388     13653.33
      16.687     0.999939        31389     16384.00
      16.687     0.999945        31389     18204.44
      16.687     0.999951        31389     20480.00
      16.687     0.999957        31389     23405.71
      16.687     0.999963        31389     27306.67
      17.391     0.999969        31390     32768.00
      17.391     1.000000        31390          inf
#[Mean    =        1.246, StdDeviation   =        0.858]
#[Max     =       17.376, Total count    =        31390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59145 requests in 30.00s, 5.85MB read
  Socket errors: connect 0, read 0, write 0, timeout 1394
Requests/sec:   1971.49
Transfer/sec:    199.51KB