wrk/results/put.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 1.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.340ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  808.46us  20.21ms   97.89%
    Req/Sec     1.24k   668.53     4.44k    64.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.35ms
 90.000%    1.54ms
 99.000%    2.76ms
 99.900%   11.95ms
 99.990%   18.78ms
 99.999%   20.22ms
100.000%   20.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.261     0.000000            1         1.00
       0.612     0.100000         4610         1.11
       0.749     0.200000         9236         1.25
       0.875     0.300000        13850         1.43
       0.989     0.400000        18441         1.67
       1.100     0.500000        23066         2.00
       1.150     0.550000        25349         2.22
       1.200     0.600000        27644         2.50
       1.252     0.650000        29961         2.86
       1.302     0.700000        32273         3.33
       1.349     0.750000        34558         4.00
       1.374     0.775000        35703         4.44
       1.400     0.800000        36871         5.00
       1.428     0.825000        38023         5.71
       1.459     0.850000        39173         6.67
       1.496     0.875000        40323         8.00
       1.516     0.887500        40888         8.89
       1.539     0.900000        41467        10.00
       1.566     0.912500        42050        11.43
       1.597     0.925000        42622        13.33
       1.639     0.937500        43198        16.00
       1.662     0.943750        43483        17.78
       1.690     0.950000        43768        20.00
       1.725     0.956250        44058        22.86
       1.766     0.962500        44348        26.67
       1.811     0.968750        44635        32.00
       1.845     0.971875        44773        35.56
       1.877     0.975000        44918        40.00
       1.922     0.978125        45062        45.71
       1.976     0.981250        45206        53.33
       2.065     0.984375        45349        64.00
       2.125     0.985938        45421        71.11
       2.213     0.987500        45493        80.00
       2.417     0.989062        45565        91.43
       3.165     0.990625        45637       106.67
       4.711     0.992188        45709       128.00
       5.427     0.992969        45745       142.22
       6.323     0.993750        45781       160.00
       6.911     0.994531        45817       182.86
       7.355     0.995313        45853       213.33
       7.967     0.996094        45889       256.00
       8.423     0.996484        45907       284.44
       8.911     0.996875        45925       320.00
       9.231     0.997266        45943       365.71
       9.527     0.997656        45961       426.67
      10.207     0.998047        45979       512.00
      10.543     0.998242        45988       568.89
      10.807     0.998437        45997       640.00
      11.207     0.998633        46006       731.43
      11.639     0.998828        46016       853.33
      12.007     0.999023        46024      1024.00
      12.199     0.999121        46028      1137.78
      12.431     0.999219        46033      1280.00
      12.927     0.999316        46037      1462.86
      13.391     0.999414        46042      1706.67
      13.615     0.999512        46046      2048.00
      13.671     0.999561        46048      2275.56
      14.335     0.999609        46051      2560.00
      14.703     0.999658        46053      2925.71
      15.007     0.999707        46055      3413.33
      15.175     0.999756        46057      4096.00
      15.647     0.999780        46058      4551.11
      16.223     0.999805        46060      5120.00
      18.607     0.999829        46061      5851.43
      18.719     0.999854        46062      6826.67
      18.783     0.999878        46063      8192.00
      18.783     0.999890        46063      9102.22
      18.831     0.999902        46064     10240.00
      19.039     0.999915        46065     11702.86
      19.039     0.999927        46065     13653.33
      19.263     0.999939        46066     16384.00
      19.263     0.999945        46066     18204.44
      19.263     0.999951        46066     20480.00
      19.535     0.999957        46067     23405.71
      19.535     0.999963        46067     27306.67
      19.535     0.999969        46067     32768.00
      19.535     0.999973        46067     36408.89
      19.535     0.999976        46067     40960.00
      20.223     0.999979        46068     46811.43
      20.223     1.000000        46068          inf
#[Mean    =        1.151, StdDeviation   =        0.808]
#[Max     =       20.208, Total count    =        46068]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  91636 requests in 30.01s, 5.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 1150
Requests/sec:   3053.97
Transfer/sec:    199.82KB