wrk/results/put_alloc.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 5.245ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 4.573ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.32ms    1.34ms  29.12ms   96.51%
    Req/Sec     0.99k   475.63     2.32k    54.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.40ms
 90.000%    1.66ms
 99.000%    7.88ms
 99.900%   17.66ms
 99.990%   24.82ms
 99.999%   29.14ms
100.000%   29.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.328     0.000000            1         1.00
       0.658     0.100000         3668         1.11
       0.795     0.200000         7294         1.25
       0.916     0.300000        10925         1.43
       1.027     0.400000        14577         1.67
       1.139     0.500000        18200         2.00
       1.192     0.550000        20011         2.22
       1.243     0.600000        21840         2.50
       1.295     0.650000        23664         2.86
       1.349     0.700000        25476         3.33
       1.404     0.750000        27288         4.00
       1.433     0.775000        28213         4.44
       1.466     0.800000        29111         5.00
       1.503     0.825000        30023         5.71
       1.543     0.850000        30937         6.67
       1.591     0.875000        31831         8.00
       1.621     0.887500        32292         8.89
       1.657     0.900000        32736        10.00
       1.707     0.912500        33196        11.43
       1.770     0.925000        33644        13.33
       1.875     0.937500        34099        16.00
       1.945     0.943750        34327        17.78
       2.065     0.950000        34555        20.00
       2.227     0.956250        34780        22.86
       2.513     0.962500        35009        26.67
       2.941     0.968750        35235        32.00
       3.259     0.971875        35348        35.56
       3.761     0.975000        35461        40.00
       4.331     0.978125        35575        45.71
       5.063     0.981250        35689        53.33
       5.971     0.984375        35802        64.00
       6.431     0.985938        35859        71.11
       6.979     0.987500        35917        80.00
       7.487     0.989062        35973        91.43
       8.215     0.990625        36031       106.67
       8.903     0.992188        36086       128.00
       9.303     0.992969        36115       142.22
       9.703     0.993750        36143       160.00
      10.311     0.994531        36172       182.86
      10.959     0.995313        36200       213.33
      11.711     0.996094        36228       256.00
      12.159     0.996484        36243       284.44
      12.983     0.996875        36257       320.00
      13.399     0.997266        36271       365.71
      14.199     0.997656        36285       426.67
      14.687     0.998047        36299       512.00
      15.215     0.998242        36307       568.89
      15.655     0.998437        36314       640.00
      16.783     0.998633        36321       731.43
      17.199     0.998828        36328       853.33
      17.727     0.999023        36335      1024.00
      18.751     0.999121        36339      1137.78
      18.975     0.999219        36343      1280.00
      19.535     0.999316        36346      1462.86
      19.919     0.999414        36349      1706.67
      21.007     0.999512        36353      2048.00
      22.111     0.999561        36355      2275.56
      22.495     0.999609        36356      2560.00
      23.055     0.999658        36358      2925.71
      23.343     0.999707        36360      3413.33
      23.775     0.999756        36362      4096.00
      24.367     0.999780        36363      4551.11
      24.367     0.999805        36363      5120.00
      24.495     0.999829        36364      5851.43
      24.527     0.999854        36365      6826.67
      24.815     0.999878        36366      8192.00
      25.103     0.999890        36367      9102.22
      25.103     0.999902        36367     10240.00
      25.103     0.999915        36367     11702.86
      25.727     0.999927        36368     13653.33
      25.727     0.999939        36368     16384.00
      25.807     0.999945        36369     18204.44
      25.807     0.999951        36369     20480.00
      25.807     0.999957        36369     23405.71
      25.807     0.999963        36369     27306.67
      25.807     0.999969        36369     32768.00
      29.135     0.999973        36370     36408.89
      29.135     1.000000        36370          inf
#[Mean    =        1.323, StdDeviation   =        1.345]
#[Max     =       29.120, Total count    =        36370]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  78865 requests in 30.00s, 5.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 1243
Requests/sec:   2628.54
Transfer/sec:    171.98KB